app/controllers/api/friendrequests_controller.rb

    def create
        previousRequest = FriendRequest.find_by(friendRequest_params)
        if previousRequest
            render json: ['Friend request already sent.'], status: 409
        else
            @friendRequest = FriendRequest.new(friendRequest_params)
            if @friendRequest.save
---
INSERT INTO "friend_requests" ("requestor_id", "receiver_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["requestor_id", 8], ["receiver_id", 14], ["created_at", "2021-06-04 19:22:19.577817"], ["updated_at", "2021-06-04 19:22:19.577817"]]

    def destroy
        puts 'in destroy'
        @friendRequest = FriendRequest.find(params[:id])
        if @friendRequest.destroy
            @allFriendRequests = FriendRequest.all
---
SELECT  "friend_requests".* FROM "friend_requests" WHERE "friend_requests"."id" = $1 LIMIT $2  [["id", 230], ["LIMIT", 1]]
DELETE FROM "friend_requests" WHERE "friend_requests"."id" = $1  [["id", 230]]
SELECT "friend_requests".* FROM "friend_requests"

    def index
        @allFriendRequests = FriendRequest.all
---
SELECT "friend_requests".* FROM "friend_requests"