app/controllers/api/friendships_controller.rb

    def create
        # puts friendship_params
        # puts friendRequest_params
        @friend_request = FriendRequest.find_by(friendRequest_params)
        if @friend_request.destroy
            # @friendship = Friendship.new(friendship_params)
            # if @frienship.save
            #     render json: ['Friendship successful'], status: 200
            # else
            #     render json: ['Friendship unsuccessful'], status: 422
            # end
            @previousFriendship = Friendship.find_by(friendship_params);
            @reversePreviousFriendship = Friendship.find_by(backwardsFriends_params);
            if @previousFriendship
                render json: ['Friendship already exists'], status: 409
            else
                if @reversePreviousFriendship
                    render json: ['Friendship already exists'], status: 409
                else
                    @friendship = Friendship.new(friendship_params)
                    if @friendship.save
---
DELETE FROM "friend_requests" WHERE "friend_requests"."id" = $1  [["id", 226]]
INSERT INTO "friendships" ("user_id", "friend_id") VALUES ($1, $2) RETURNING "id"  [["user_id", 8], ["friend_id", 2]]

    def index
        @friendships = Friendship.all
---
SELECT "friendships".* FROM "friendships"