app/controllers/api/messages_controller.rb

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
---
    def create
        p 'in create'
        @message = Message.new(message_params)
        room = Room.find(message_params["room_id"])

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1  [["room_id", 27]]
---
    def index
        p 'in index -->'
        p params
        @messages = Rooms.find(params[:roomId]).messages