app/controllers/api/profilebio_controller.rb

INSERT INTO "profile_bios" ("user_bio", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
SELECT "profile_bios".* FROM "profile_bios"
---
    def create
        @profilebio = ProfileBio.new(bio_params)
        if @profilebio.save
            @profilebios = ProfileBio.all

SELECT  "profile_bios".* FROM "profile_bios" WHERE "profile_bios"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
    def update
        @profilebio = ProfileBio.find(params[:id])

SELECT "profile_bios".* FROM "profile_bios"
---
    def index
        @profilebios = ProfileBio.all