app/controllers/api/rooms_controller.rb

    def index
        @rooms = Rooms.all
---
SELECT "rooms".* FROM "rooms"