app/controllers/api/roommemberships_controller.rb

    def index
        @allRoomMemberships = RoomMembership.all
---
SELECT "room_memberships".* FROM "room_memberships"