app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "session_token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "joe breeze"], ["email", "joe@breeze.com"], ["password_digest", "$2a$12$NeeVtql/L/Ls0VuAEnDi7.2uXXb8RNrPQTSkJuuX7JhB8p/wGI7hW"], ["session_token", "GFjCS2gt-6b_-1dp-QpbUw"]]