app/views/chat/messages/index.json.jbuilder

SELECT  "messages".* FROM "messages" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 25]]
---
json.messages(Message.limit(25).order("created_at DESC").load.reverse) do |message|