app/channels/rooms_channel.rb

  def subscribed
    # stream_from "some_channel"
    # stream_from 'rooms_channel'
    # stream_from("rooms_#{params[:room_id]}")
    @room = Rooms.find_by(id: params[:room_id])
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]

  def create(data)
    p 'IN CREATE ROOMSCHANNEL'
    p data
    # debugger
    # ActionCable.server.broadcast 'rooms_channel', message: data['message']
    user_id = data['user_id']
    room_id = data['room_id']
    message = data['body']

    raise 'No room_id' if room_id.blank?
    raise 'No user_id' if user_id.blank?
    raise 'No message!' if message.blank?

    Message.create!(
      room_id: room_id,
      user_id: user_id,
      body: message
    )
---
INSERT INTO "messages" ("body", "user_id", "room_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "hello?"], ["user_id", 8], ["room_id", 51], ["created_at", "2021-06-16 20:24:23.555618"], ["updated_at", "2021-06-16 20:24:23.555618"]]