app/models/user.rb

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "6-9VyGdMTr2Ej5AjWNQRnw"], ["id", 8]]
---
    def reset_session_token!
        self.session_token = SecureRandom.urlsafe_base64
        self.save!