app/jobs/messages_broadcast_job.rb

  def perform(message)
    p 'IN PERFORM'
    # p message
    # p message.room_id
    @room = Rooms.find_by(id: message.room_id)
---
SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 51], ["LIMIT", 1]]